Repository: EtorgFalo/GTKCrypto
Catalog: po/*/*-gui.po
Languages: it

source: About
it: A Proposito

source: Quit
it: Uscire

source: Welcome to PolCrypt %s
it: Benvenuti su PolCrypt %s

source: Encrypt File
it: Cifrare File

source: Decrypt File
it: Decifrare File

source: Compute Hash
it: Calcolare Hash

source: Choose File
it: Scegliere File

source: _Cancel
it: _Annulla

source: _Quit
it: _Chiudere

source: Type password
it: Immettere password

source: Retype password
it: Reimmettere password

source: Select Hash
it: Selezionare Hash
