Repository: EtorgFalo/GTKCrypto
Catalog: po/*-cli.po
Languages: it

source: You are root, please run this program as NORMAL USER!
it: Per favore avviare questo programma da utente normale e *non* da utente root.

source: libgcrypt min version required: 1.5.0
it: libgcrypt versione minima richiesta 1.5.0

source: PolCrypt v%s developed by Paolo Stivanin <info@paolostivanin.com>
it: PolCrypt v%s sviluppato da Paolo Stivanin <info@paolostivanin.com>

source: To encrypt|decrypt a file: %s [--encrypt] | [--decrypt] <path-to-input_file> --output <path_to_output_file>
it: Per cifrare|decifrare un file: %s [--encrypt] | [--decrypt] <percorso-file-input> --output <percorso-file-output>

source: To calculate one or more file hash: %s --hash <path-to-input_file> --algo [md5|rmd160|sha1|sha256|sha512|whirlpool|all]
it: Per calcolare uno o pi√π tipi di hash: %s --hash <percorso-file-input> --algo [md5|rmd160|sha1|sha256|sha512|whirlpool|all]

source: main (case e): error during memory allocation
it: main (case e): errore durante allocazione memoria

source: main (case d): error during memory allocation
it: main (case d): errore durante allocazione memoria

source: main (case s): error during memory allocation
it: main (case s): errore durante allocazione memoria

source: You must select an hash algo. Use --help for more information
it: Devi selezionare un algortimo di hash. Usa --help per maggiori informazioni

source: You must use the option --hash to use the option --algo
it: Con l'opzione --algo devi specifiare anche l'opzione --hash. Usa --help per maggiori informazioni

source: main (case a): error during memory allocation
it: main (case a): errore durante allocazione memoria

source: You must use the option --encrypt || --decrypt to use the option --output
it: Con l'opzione --output devi specifiare anche l'opzione --encrypt || --decrypt

source: main (case o): error during memory allocation
it: main (case o): errore durante allocazione memoria

source: Unknown option
it: Opzione sconosciuta

source: main: error during file encryption
it: main: errore durante la cifratura del file

source: main: error during file decryption
it: main: errore durante la decifratura del file

source: --> Available hash algo are: md5, rmd160, sha1, sha256, sha512 and whirlpool
it: --> Algoritmi di hash disponibili: md5, rmd160, sha1, sha256, sha512 e whirlpool
